export const INPUT_TYPES = {
  TEXT: "text",
  CHECKBOX: "checkbox",
  TEXTAREA: "textarea",
  STRING_DATE: "string-date",
  NUMBER: "number",
  SELECT: "select",
};

export const VALIDATION_ERRORS = {
  DATE_ERROR: "Дата введена неверно. Введите дату в формате ДД/ММ/ГГГГ",
  EMAIL_ERROR: "Почта введена неверно. Введите почту в правильном формате.",
  ABOUTYOU_ERROR: "Вы превысили максимальное количество символов(500).",
  WORKPLACE_ERROR: "Вы превысили максимальное количество символов(50).",
  EXPERIENCE_ERROR: "Вы превысили максимальное количество символов(70).",
  NAME_ERROR: "Вы превысили максимальную длину имени(40).",
  EDUCATION_ERROR: "Вы превысили максимальное количество символов(50).",
};

export const dateRegex = /(^(((0[1-9]|1[0-9]|2[0-8])[\/](0[1-9]|1[012]))|((29|30|31)[\/](0[13578]|1[02]))|((29|30)[\/](0[4,6,9]|11)))[\/](19|[2-9][0-9])\d\d$)|(^29[\/]02[\/](19|[2-9][0-9])(00|04|08|12|16|20|24|28|32|36|40|44|48|52|56|60|64|68|72|76|80|84|88|92|96)$)/g;

export const emailRegex = /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/g;
